src/InformationRegisters/ObjectVersions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ObjectVersions</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ObjectVersion</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>VersionAuthor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExternalUsers</v8:Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VersionDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Object</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>VersionNo</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ObjectVersions/Forms/StoredVersionsChoice/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// SECTION OF FORM AND FORM ITEMS EVENT HANDLERS

// Handler of the form event "OnCreateAtServer"
//
&AtServer
Procedure OnCreateAtServer(Cancellation, StandardProcessing)
	
	Ref = Parameters.Ref;
	
	If ObjectVersioning.GetObjectVersionsCount(Ref) = 0 Then
		Items.MainPage.CurrentPage = Items.NoVersionsForCompare;
		Text_MissingVersions = StringFunctionsClientServer.SubstitureParametersInString(
		                               NStr("en = 'No stored versions relating tom the object <%1>.'"),
		                               String(Ref));
	EndIf;
	
	ValueToFormAttribute(GenerateVersionsTable(Ref), "VersionsList");
	
EndProcedure

// Function returns the list of numbers of versions of the object passed by ref
//
// Parameters:
// Ref        - CatalogRef, DocumentRef - object ref
//
&AtServerNoContext
Function GenerateVersionsTable(Ref)
	
	Query = New Query;
	Query.Text = "SELECT VersionNo, VersionAuthor, VersionDate
	                | FROM InformationRegister.ObjectVersions
	                | WHERE Object=&Ref
	                | ORDER BY VersionNo Desc";
	Query.SetParameter("Ref", Ref);
	
	Return Query.Execute().Unload();
	
EndFunction

// Handler of event "Selection" of table box "VersionsList"
//
&AtClient
Procedure VersionsListSelection(Item, RowSelected, Field, StandardProcessing)
	
	OpenObjectVersion();
	
EndProcedure

// Handler of click on the button "OpenObjectVersion"
//
&AtClient
Procedure OpenObjectVersionExecute()
	
	OpenObjectVersion();
	
EndProcedure

// Handler of click on the "ReportByChanges"
//
&AtClient
Procedure GenerateChangesReportExecute()
	
	SelectedRows = Items.VersionsList.SelectedRows;
	
	SelectedVersions = GenerateListOfSelectedVersions(SelectedRows);
	
	If SelectedVersions.Count() < 2 Then
		DoMessageBox(NStr("en = 'To generate report by change it is necessary to select minimum two versions.'"));
	Else
		OpenReportForm(SelectedVersions);
	EndIf;
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// Section of the service functions

// Checks, that in version list some version was selected and returns the report
// form with the passed parameter - number of the selected version.
//
&AtClient
Procedure OpenObjectVersion()
	
	If ValueIsFilled(Items.VersionsList.CurrentData.VersionNo) Then
		SelectedVersions = New ValueList;
		SelectedVersions.Add(Items.VersionsList.CurrentData.VersionNo);
		
		If SelectedVersions <> Undefined Then
			OpenReportForm(SelectedVersions);
		EndIf;
	Else
		DoMessageBox(NStr("en = 'To continue it is necessary to choose object version'"));
	EndIf;
	
EndProcedure

// Opens form of the report by changes, with the required parameters
//
&AtClient
Procedure OpenReportForm(VersionsListParameter)
	
	ReportParameters = New Structure;
	ReportParameters.Insert("Ref", Ref);
	ReportParameters.Insert("VersionsList", VersionsListParameter);
	
	OpenForm("Report.ReportByVersions.Form.ReportForm",
	             ReportParameters,
	             ThisForm,
	             Uuid);
	
EndProcedure

// Function returns number list of the selected versions
//
&AtClient
Function GenerateListOfSelectedVersions(SelectedRows)
	
	SelectedVersions = New ValueList;
	
	For Each SelectedRowsNumber In SelectedRows Do
		SelectedVersions.Add(VersionsList[SelectedRowsNumber].VersionNo);
	EndDo;
	
	SelectedVersions.SortByValue(SortDirection.Asc);
	
	Return SelectedVersions;
	
EndFunction
